[
  {
    "1": "Split the sub-array using the same logic from the original array. Enter the values of the left-sub array.",
    "2": "Once again, split the sub-array as evenly as possible. Enter the two values of the left-sub array. The remaining number will me merged later on.",
    "3": "To separate the sub-array, enter the first array value on the left.",
    "4": "Now, enter the remaining array value.",
    "5": "An array of length 1 cannot be split further. Now it is ready for merge. Order the two numbers by least to greatest, and enter the values accordingly.",
    "6": "Enter the remaining value that was left above from the third array split.",
    "7": "Now, merge the array together. Order the 3 array values from minimum to maximum.",
    "8": "Return to the original sub-array. Enter the 2 remaining values left behind from the first array split.",
    "9": "To separate the sub-array, enter the first array value on the left.",
    "10": "Now, enter the remaining array value.",
    "11": "An array of length 1 cannot be split further. Now it is ready for merge. Order the two numbers by least to greatest, and enter the values accordingly.",
    "12": "Order the final array from least to greatest and enter the values accordingly.",
    "13": "Return to the original array. With the remaining 5 values, enter the values of the right sub-array.",
    "14": "Split the sub-array using the same logic from the original array. Enter the values of the left-sub array.",
    "15": "Once again, split the sub-array as evenly as possible. Enter the two values of the left-sub array. The remaining number will me merged later on.",
    "16": "To separate the sub-array, enter the first array value on the left.",
    "17": "Now, enter the remaining array value.",
    "18": "An array of length 1 cannot be split further. Now it is ready for merge. Order the two numbers by least to greatest, starting with the smaller (or equal) value.",
    "19": "Enter the reamining larger value",
    "20": "Enter the the remaining value that was left above from the third array split.",
    "21": "Compare the first values of each sub-array and enter the smaller value into the first spot of the merged array.",
    "22": "When one sub-array becomes empty, enter the remaining values from the other sub-array. Start with the first value.",
    "23": "Enter the last value remaining.",
    "24": "Return to the original sub-array. Enter the 2 remaining values left behind from the first array split.",
    "25": "To separate the sub-array, enter the first array value on the left.",
    "26": "Now, enter the remaining array value.",
    "27": "An array of length 1 cannot be split further. Now it is ready for merge. Order the two numbers by least to greatest, starting with the smaller (or equal) value.",
    "28": "Enter the remaining larger value",
    "29": "Compare the first values of each sub-array and enter the smaller value into the first spot of the merged array.",
    "30": "Repeat step. Compare the first values of each remaining sub-array and enter the smaller value into the next spot of the merged array.",
    "31": "Repeat step. Compare the first values of each remaining sub-array and enter the smaller value into the next spot of the merged array.",
    "32": "When one sub-array becomes empty, enter the remaining values from the other sub-array. Start with the first value.",
    "33": "Enter the last value remaining.",
    "34": "Split the original array in half as evenly as possible. Take the floor function of the length/2 to correctly divide the array. Enter the values of the right sub-array.",
    "35": "Split the sub-array using the same logic from the original array. Enter the values of the right-sub array.",
    "36": "",
    "60": "Great! You’ve reached the final step of the merge sort algorithm. The only step left to do is to sort the the final array. Enter the values from least to greatest, accounting for both sub-arrays."
  }
]
